#include "stm32f10x.h"

//******************************************************************************
// Сохраняем значение в памяти "BACKUP"
//******************************************************************************
void config_mem_store_uint16( const uint16_t adr, const uint16_t data)
{
     BKP_WriteBackupRegister( adr, data );
}

//******************************************************************************
// Читаем значение из памяти "BACKUP"
//******************************************************************************
uint16_t config_mem_load_uint16( const uint16_t adr )
{
     return BKP_ReadBackupRegister( adr );
}
